#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Инициализировать();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ЗаполнитьСтатистику();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ИнициализацияФормы

#Область Общие

&НаКлиенте
Процедура ЗаполнитьСтатистику()
	
	//@skip-check use-non-recommended-method
	РаботаСМетаданными = ПолучитьФорму(Объект.ПутьКФормам + "РаботаСМетаданными");
	Если ЗначениеЗаполнено(ИмяПоля) Тогда
		РаботаСМетаданными.ЗаполнитьСтатистикуРеквизитаПоТипам(ЭтотОбъект, ИмяПоля, ИмяТаблицы);
	Иначе
		РаботаСМетаданными.ЗаполнитьСтатистикуПоСсылающимсяТипам(ЭтотОбъект, ПолноеИмя, Раздел, ТипПоиска);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Инициализировать()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Объект.ПутьКФормам = ОбработкаОбъект.Метаданные().ПолноеИмя() + ".Форма.";
	
	ЗаполнитьПараметры();
	
КонецПроцедуры

#КонецОбласти

#Область Частные

&НаСервере
Процедура ЗаполнитьПараметры()
	
	ПолноеИмя       = Параметры.ПолноеИмя;
	ИмяПоля         = Параметры.ИмяПоля;
	ИмяТаблицы      = Параметры.ИмяТаблицы;
	Раздел          = Параметры.Раздел;
	ТипПоиска       = Параметры.ТипПоиска;
	
	Если ЗначениеЗаполнено(Параметры.ЗначениеТипа) Тогда
		ЧислоСтрок = СтрЧислоСтрок(Параметры.ЗначениеТипа);
		Для Индекс = 1 По ЧислоСтрок Цикл
			НоваяСтрока = Типы.Добавить();
			НоваяСтрока.ПолноеИмя = СтрПолучитьСтроку(Параметры.ЗначениеТипа, Индекс);
			НоваяСтрока.Простой   = СтрЧислоВхождений(НоваяСтрока.ПолноеИмя, ".") = 0;
		КонецЦикла;
		Типы.Сортировать("Простой Убыв, ПолноеИмя Возр");
		ШаблонЗаголовка = НСтр("ru = 'Список типов объекта ""%1""'");
	ИначеЕсли ТипПоиска = 1 тогда
		ШаблонЗаголовка = НСтр("ru = 'Список ссылающихся типов на объект ""%1""'");
	ИначеЕсли ТипПоиска = 2 тогда
		ШаблонЗаголовка = НСтр("ru = 'Список ссылающихся типов из объекта ""%1""'");
	КонецЕсли;
	
	Заголовок = СтрШаблон(ШаблонЗаголовка, СокрЛП(ПолноеИмя));
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Объект.ПутьКФормам = ОбработкаОбъект.Метаданные().ПолноеИмя() + ".Форма.";
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти