#Область ОписаниеПеременных

&НаСервере
Перем ОбработкаОбъект; // Доступ к модулю и реквизитам объекта обработки

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Инициализировать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура Подключаемый_ПолеВводаНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) Экспорт
	
	ВыбратьТипЭлемента(Элемент);
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Изменить(Команда)
	
	ИзменитьДоступность();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЗаписатьДанныеФормыИЗакрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	
	Закрыть();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСФормой

#Область Общие

&НаКлиенте
Процедура ВыбратьТипЭлемента(Элемент)
	
	ПараметрЭлемента = ПараметрыЭлементов.НайтиСтроки(Новый Структура("Имя", Элемент.Имя))[0];
	ДанныеТипов = Новый СписокЗначений;
	Для Каждого Тип Из ПараметрЭлемента.ОписаниеТипов.Типы() Цикл
		ДанныеТипов.Добавить(Тип);
	КонецЦикла;
	
	ЗавершениеВыбораТипаЭлемента = Новый ОписаниеОповещения(
		"ЗавершениеВыбораТипаЭлемента",
		ЭтотОбъект,
		Новый Структура("Элемент, ПараметрЭлемента", Элемент, ПараметрЭлемента)
	);
	
	Если ДанныеТипов.Количество() > 1 Тогда
		ДанныеТипов.ПоказатьВыборЭлемента(ЗавершениеВыбораТипаЭлемента, НСтр("ru = 'Выберите тип значения'"));
	Иначе
		ВыполнитьОбработкуОповещения(ЗавершениеВыбораТипаЭлемента, ДанныеТипов[0]);
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИзменитьДоступность()
	
	Элементы.ФормаИзменить.Пометка = НЕ Элементы.ФормаИзменить.Пометка;
	
	Элементы.ГруппаДанныеОбъекта.ТолькоПросмотр = Не Элементы.ФормаИзменить.Пометка;
	Элементы.ФормаЗаписатьОбъект.Доступность = Элементы.ФормаИзменить.Пометка;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьОбработкаОбъект()
	
	Если ОбработкаОбъект = Неопределено Тогда
		ОбработкаОбъект = РеквизитФормыВЗначение("ВнешняяОбработка");
		ВнешняяОбработка.ПутьКФормам = ОбработкаОбъект.Метаданные().ПолноеИмя() + ".Форма.";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Инициализировать()
	
	ИнициализироватьОбработкаОбъект();
	
	КлючФормы = Параметры.КлючФормы;
	
	ОбъектМетаданных = КлючФормы.Метаданные();
	Раздел           = ОбработкаОбъект.ПолучитьРазделПоОбъекту(ОбъектМетаданных);
	ОписаниеОбъекта  = ОбработкаОбъект.ПолучитьОписаниеОбъекта(ОбъектМетаданных, Раздел, Новый Соответствие);
	ОсновнаяТаблица  = ОписаниеОбъекта.ПолноеИмя;
	ЭтоНаборЗаписей  = ОписаниеОбъекта.ЭтоНаборЗаписей;
	Если ЭтоНаборЗаписей Тогда
		МенеджерОбъекта = ОбработкаОбъект.МенеджерОбъектаПоПолномуИмени(ОсновнаяТаблица);
		ДанныеФормы     = МенеджерОбъекта.СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(ДанныеФормы, КлючФормы);
		ДанныеФормы.Прочитать();
	Иначе
		ДанныеФормы      = КлючФормы.ПолучитьОбъект();
	КонецЕсли;
	
	ТипОбъекта = Новый Массив;
	ТипОбъекта.Добавить(ТипЗнч(ДанныеФормы));
	РеквизитФормыОбъект = Новый РеквизитФормы("Объект", Новый ОписаниеТипов(ТипОбъекта));
	РеквизитыФормы = Новый Массив;
	РеквизитыФормы.Добавить(РеквизитФормыОбъект);
	ИзменитьРеквизиты(РеквизитыФормы);
	ЗначениеВРеквизитФормы(ДанныеФормы, "Объект");
	ТекущийОбъект = ЭтотОбъект["Объект"];
	
	ЗаполнятьПоГруппамИЭлементам = ОписаниеОбъекта.Раздел = "Справочники" И ТекущийОбъект.Свойство("ЭтоГруппа");
	
	ГруппаДанныеОбъекта = Элементы.Добавить("ГруппаДанныеОбъекта", Тип("ГруппаФормы"), ЭтотОбъект);
	ГруппаДанныеОбъекта.Вид = ВидГруппыФормы.Страницы;
	
	ГруппаРеквизитыФормы = Элементы.Добавить("ГруппаРеквизитыФормы", Тип("ГруппаФормы"), ГруппаДанныеОбъекта);
	ГруппаРеквизитыФормы.Вид       = ВидГруппыФормы.Страница;
	ГруппаРеквизитыФормы.Заголовок = "РеквизитыФормы";
	
	Для Каждого РеквизитыОбъекта Из ОписаниеОбъекта.Объекты Цикл
		
		Если НЕ РеквизитыОбъекта.ЭтоТаблица И НЕ РеквизитыОбъекта.ЭтоПолеДанных Тогда
			Продолжить;
		КонецЕсли;
		
		Пропустить =
			НЕ РеквизитыОбъекта.ЭтоСтандартныйРеквизит
			И (
				ЗаполнятьПоГруппамИЭлементам
				И ТекущийОбъект.ЭтоГруппа
				И РеквизитыОбъекта.ОбъектМетаданных.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляЭлемента
				ИЛИ ЗаполнятьПоГруппамИЭлементам
				И Не ТекущийОбъект.ЭтоГруппа
				И РеквизитыОбъекта.ОбъектМетаданных.Использование = Метаданные.СвойстваОбъектов.ИспользованиеРеквизита.ДляГруппы
			);
		Если Пропустить Тогда
			Продолжить;
		КонецЕсли;
		
		Если РеквизитыОбъекта.ЭтоТаблица Тогда
			ГруппаТаблицаФормы = Элементы.Добавить("Группа" + РеквизитыОбъекта.Имя, Тип("ГруппаФормы"), ГруппаДанныеОбъекта);
			ГруппаТаблицаФормы.Вид       = ВидГруппыФормы.Страница;
			ГруппаТаблицаФормы.Заголовок = РеквизитыОбъекта.Имя;
			ТаблицаФормы = Элементы.Добавить(РеквизитыОбъекта.Имя, Тип("ТаблицаФормы"), ГруппаТаблицаФормы);
			ТаблицаФормы.ПутьКДанным = "Объект." + РеквизитыОбъекта.Имя;
			Для Каждого РеквизитыТаблицыОбъекта Из РеквизитыОбъекта.Объекты Цикл
				СоздатьЭлементФормы(РеквизитыТаблицыОбъекта, ТаблицаФормы, РеквизитыОбъекта.Имя);
			КонецЦикла;
		Иначе
			СоздатьЭлементФормы(РеквизитыОбъекта, ГруппаРеквизитыФормы, "");
		КонецЕсли;
		
	КонецЦикла;
	
	ИзменитьДоступность();
	
КонецПроцедуры

#КонецОбласти

#Область Частные

&НаКлиенте
Процедура ЗавершениеВыбораТипаЭлемента(ВыбранныйЭлемент, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныйЭлемент = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры.ПараметрЭлемента.ПолноеИмя = ПолучитьПолноеИмяМетаданныхПоТипу(ВыбранныйЭлемент.Значение);
	ВыбратьЗначениеЭлемента(ДополнительныеПараметры);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьЗначениеЭлемента(ПараметрыВыбора)
	
	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("РеквизитыТаблицы",     СтрРазделить("Ссылка;ПометкаУдаления", ";"));
	ПараметрыОткрытия.Вставить("ОсновнаяТаблица",      ПараметрыВыбора.ПараметрЭлемента.ПолноеИмя);
	ПараметрыОткрытия.Вставить("ДинамическийСписок",   Истина);
	ПараметрыОткрытия.Вставить("СистемнаяТаблица",     "");
	ПараметрыОткрытия.Вставить("РежимВыбора",          Истина);
	ПараметрыОткрытия.Вставить("ЗакрыватьПриВыборе",   Истина);
	ПараметрыОткрытия.Вставить("ВыборГруппИЭлементов", ИспользованиеГруппИЭлементов.ГруппыИЭлементы);
	
	ОткрытьФорму(
		ВнешняяОбработка.ПутьКФормам + "СписокЭлементов",
		ПараметрыОткрытия,
		ПараметрыВыбора.Элемент,
		Новый УникальныйИдентификатор
	);
	
КонецПроцедуры

&НаСервере
Процедура СоздатьЭлементФормы(РеквизитыОбъекта, ГруппаЭлемента, ИмяТаблицы)
	
	Поле = Элементы.Добавить(ИмяТаблицы + РеквизитыОбъекта.Имя, Тип("ПолеФормы"), ГруппаЭлемента);
	Поле.Вид = ВидПоляФормы.ПолеВвода;
	Если РеквизитыОбъекта.ЭтоРедактируемыйТип Тогда
		Поле.ПутьКДанным = "Объект." + ИмяТаблицы + ?(ЗначениеЗаполнено(ИмяТаблицы), ".", "") + РеквизитыОбъекта.Имя;
		Если РеквизитыОбъекта.ЭтоСсылка Тогда
			Поле.УстановитьДействие("НачалоВыбора", "Подключаемый_ПолеВводаНачалоВыбора");
			НоваяСтрока = ПараметрыЭлементов.Добавить();
			НоваяСтрока.Имя           = Поле.Имя;
			НоваяСтрока.ОписаниеТипов = РеквизитыОбъекта.ОбъектМетаданных.Тип;
			НоваяСтрока.ПолноеИмя     = "";
		КонецЕсли;
	Иначе
		Поле.ТолькоПросмотр = Истина;
		ПутьКДаннымРеквизита = ДобавитьНеРедактируемыйРеквизит(
			РеквизитыОбъекта.Имя,
			ИмяТаблицы,
			РеквизитыОбъекта.ЭтоТипДляПросмотра
		);
		Поле.ПутьКДанным = ПутьКДаннымРеквизита;
	КонецЕсли;
	
	Поле.РастягиватьПоГоризонтали = Истина;
	Поле.Заголовок = РеквизитыОбъекта.Имя;
	
КонецПроцедуры 

&НаСервере
Функция ДобавитьНеРедактируемыйРеквизит(ИмяРеквизита, ИмяТаблицы, ЭтоТипДляПросмотра = Истина)
	
	НовоеИмяРеквизита = ИмяРеквизита + "НеРедактируемый";
	РеквизитФормыОбъект = Новый РеквизитФормы(
		НовоеИмяРеквизита,
		Новый ОписаниеТипов("Строка"),
		?(ЗначениеЗаполнено(ИмяТаблицы), "Объект." + ИмяТаблицы, "")
	);
	РеквизитыФормы = Новый Массив;
	РеквизитыФормы.Добавить(РеквизитФормыОбъект);
	ИзменитьРеквизиты(РеквизитыФормы);
	
	Если ЗначениеЗаполнено(ИмяТаблицы) Тогда
		Для Каждого СтрокаТаблицы Из ЭтотОбъект["Объект"][ИмяТаблицы] Цикл
			СтрокаТаблицы[НовоеИмяРеквизита] = ?(ЭтоТипДляПросмотра, Строка(СтрокаТаблицы[ИмяРеквизита]), НСтр("ru = '<Хранилище данных>'"));
		КонецЦикла;
	Иначе
		ЭтотОбъект[НовоеИмяРеквизита] = ?(ЭтоТипДляПросмотра, Строка(ЭтотОбъект["Объект"][ИмяРеквизита]), НСтр("ru = '<Хранилище данных>'"));
	КонецЕсли;
	
	Возврат ?(ЗначениеЗаполнено(ИмяТаблицы), "Объект." + ИмяТаблицы + ".", "") + НовоеИмяРеквизита;
	
КонецФункции

&НаСервере
Функция ПолучитьПолноеИмяМетаданныхПоТипу(Знач Тип)
	
	ИнициализироватьОбработкаОбъект();
	
	Возврат ОбработкаОбъект.ПолучитьПолноеИмяМетаданныхПоТипу(Тип);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область РаботаСДанными

#Область Общие

&НаКлиенте
Процедура ЗаписатьДанныеФормыИЗакрыть()
	
	ЗаписатьДанныеФормы();
	Если ЭтоНаборЗаписей Тогда
		ОповеститьОбИзменении(ЭтотОбъект["Объект"].ИсходныйКлючЗаписи);
	Иначе
		ОповеститьОбИзменении(ЭтотОбъект["Объект"].Ссылка);
	КонецЕсли;
	Закрыть();
	
КонецПроцедуры

&НаСервере
Процедура ЗаписатьДанныеФормы()
	
	ИнициализироватьОбработкаОбъект();
	
	ДанныеФормы = РеквизитФормыВЗначение("Объект");
	Если ЭтоНаборЗаписей Тогда
		МенеджерОбъекта = ОбработкаОбъект.МенеджерОбъектаПоПолномуИмени(ОсновнаяТаблица);
		НаборЗаписей = МенеджерОбъекта.СоздатьНаборЗаписей();
		Для Каждого Элемент Из НаборЗаписей.Отбор Цикл
			НаборЗаписей.Отбор[Элемент.Имя].Установить(ЭтотОбъект["Объект"][Элемент.Имя]);
		КонецЦикла;
		НаборЗаписей.Прочитать();
		Если НаборЗаписей.Количество() = 0 Тогда
			Запись = НаборЗаписей.Добавить();
		Иначе
			Запись = НаборЗаписей[0];
		КонецЕсли;
		ЗаполнитьЗначенияСвойств(Запись, ЭтотОбъект["Объект"]);
		ОбъектЗаписи = НаборЗаписей;
	Иначе
		ОбъектЗаписи = ДанныеФормы;
	КонецЕсли;
	
	ОбъектЗаписи.ОбменДанными.Загрузка = Истина;
	ОбъектЗаписи.Записать();
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти