#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПродолжитьЗагрузку(Команда)
	
	ЗадатьВопросОчистки();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область ЗакрытиеФормы

#Область Общие

&НаКлиенте
Процедура ЗадатьВопросОчистки()
	
	ЗадатьВопросОчисткиЗавершении  = Новый ОписаниеОповещения("ЗадатьВопросОчисткиЗавершении", ЭтотОбъект);
	
	Если ОчищатьНеСовпадающиеЭлементы Тогда
		ПоказатьВопрос(ЗадатьВопросОчисткиЗавершении,
			Элементы.ОчищатьНеСовпадающиеЭлементы.Подсказка,
			РежимДиалогаВопрос.ДаНет);
	Иначе
		ВыполнитьОбработкуОповещения(ЗадатьВопросОчисткиЗавершении, КодВозвратаДиалога.Да);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Частные

&НаКлиенте
Процедура ЗадатьВопросОчисткиЗавершении(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		Закрыть(ОчищатьНеСовпадающиеЭлементы);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти