#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Инициализировать();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыТаблицаФормы

&НаКлиенте
Процедура Подключаемый_ПередРазворачиванием(Элемент, Строка, Отказ) Экспорт
	
	НайтиСсылкиПоЗначениюРеквизита(Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриАктивизацииЯчейки(Элемент) Экспорт
	
	Интервал = 0.1;
	ПодключитьОбработчикОжидания("ОпределитьУникальныйИдентификатор", Интервал, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_Выбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка) Экспорт
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ОткрытьФормуРедактирования(ВыбраннаяСтрока, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УдалитьБезКонтроля(Команда)
	
	УдалитьОбъектПоКлючу();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьСКонтролем(Команда)
	
	УдалитьОбъектПоКлючу(Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдаление(Команда)
	
	ПометитьНаУдалениеОбъектПоКлючу();
	
КонецПроцедуры

&НаКлиенте
Процедура РежимОбменаДанными(Команда)
	
	СменитьРежимУдаленияОбъекта();
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиСсылкиНаОбъект(Команда)
	
	НайтиСсылкиНаОбъектПоКлючу();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьВсехПомеченныеБезКонтроля(Команда)
	
	ЗадатьВопросЗапуститьУдалениеВсехПомеченныхБезКонтроля();
	
КонецПроцедуры

&НаКлиенте
Процедура ПоказатьВСписке(Команда)
	
	ОткрытьФормуТекущегоЭлемента("ФормаСписка");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуЭлемента(Команда)
	
	ОткрытьФормуТекущегоЭлемента("ФормаРедактирования");
	
КонецПроцедуры

&НаКлиенте
Процедура НайтиОбъект(Команда)
	
	УказатьСсылкуНаОбъект();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РаботаСФормой

#Область Общие

&НаКлиенте
Процедура ОткрытьФормуТекущегоЭлемента(ТипФормы)
	
	ТекущиеДанные     = Элементы[ИмяСписка].ТекущиеДанные;
	ТекущаяСтрока     = Элементы[ИмяСписка].ТекущаяСтрока;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(УникальныйИдентификаторЯчейки) И УникальныйИдентификаторЯчейки <> УникальныйИдентификаторСтроки Тогда
		ИмяТекущегоПоля = ОпределитьИмяТекущегоПоляНаСервере();
		СсылкаПерехода = ТекущиеДанные[ИмяТекущегоПоля];
		ФормаТекущегоЭлемента = ПолучитьФормуПоОбъектуМетаданных(СсылкаПерехода, ТипФормы);
	ИначеЕсли ЗначениеЗаполнено(УникальныйИдентификаторСтроки) Тогда
		СсылкаПерехода = ТекущаяСтрока;
		ФормаТекущегоЭлемента = ПолучитьФормуПоОбъектуМетаданных(ОсновнаяТаблица, ТипФормы);
	Иначе
		Возврат;
	КонецЕсли;
	
	Если ТипФормы = "ФормаСписка" Тогда
		ПараметрыФормы = Новый Структура("ТекущаяСтрока", СсылкаПерехода);
	Иначе
		ПараметрыФормы = Новый Структура("Ключ", СсылкаПерехода);
	КонецЕсли;
	
	ОткрытьФорму(ФормаТекущегоЭлемента, ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуРедактирования(КлючФормы, СтандартнаяОбработка) Экспорт
	
	Если Не ВладелецФормы = Неопределено И ЗакрыватьПриВыборе Тогда
		ОповеститьОВыборе(КлючФормы);
	Иначе
		ПараметрыОткрытия = Новый Структура("КлючФормы", КлючФормы);
		ОткрытьФорму(
			Объект.ПутьКФормам + "ФормаЭлементаНаРедактирование",
			ПараметрыОткрытия
		);
		СтандартнаяОбработка = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура Инициализировать()
	
	ИмяСписка = "Список";
	
	СистемнаяТаблица    = Параметры.СистемнаяТаблица;
	ОсновнаяТаблица     = Параметры.ОсновнаяТаблица;
	РеквизитыТаблицы    = Параметры.РеквизитыТаблицы; // Массив Из Строка
	РеквизитГруппировки = Параметры.РеквизитГруппировки;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Объект.ПутьКФормам = ОбработкаОбъект.Метаданные().ПолноеИмя() + ".Форма.";
	
	Если Параметры.ДинамическийСписок Тогда
		СоздатьДинамическийСписок(ОсновнаяТаблица, РеквизитыТаблицы, СистемнаяТаблица);
	Иначе
		СоздатьДерево(ОсновнаяТаблица, РеквизитыТаблицы, СистемнаяТаблица);
	КонецЕсли;
	
	Элементы.ФормаРежимОбменаДанными.Пометка = Ложь;
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура СообщитьПользователю(Текст, КлючДанных = Неопределено)
	
	СообщениеПользователю = Новый СообщениеПользователю;
	СообщениеПользователю.Текст = Текст;
	Если ЗначениеЗаполнено(КлючДанных) Тогда
		СообщениеПользователю.КлючДанных = КлючДанных;
	КонецЕсли;
	СообщениеПользователю.Сообщить();
	
КонецПроцедуры

#КонецОбласти

#Область Частные

&НаСервере
Функция ПолучитьФормуПоОбъектуМетаданных(Знач ОбъектМетаданных, Знач ТипФормы)
	
	Если ТипЗнч(ОбъектМетаданных) = Тип("Строка") Тогда
		ПолноеИмя = ОбъектМетаданных;
	Иначе
		ПолноеИмя = ОбъектМетаданных.Метаданные().ПолноеИмя();
	КонецЕсли;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.ПолучитьФормуПоОбъектуМетаданных(ПолноеИмя, ТипФормы);
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область УникальныеИдентификаторы

#Область Общие

&НаКлиенте
Процедура ОпределитьУникальныйИдентификатор()
	
	ТекущиеДанные     = Элементы[ИмяСписка].ТекущиеДанные;
	ТекущаяСтрока     = Элементы[ИмяСписка].ТекущаяСтрока;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Свойство("ГруппировкаСтроки") Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТекущегоПоля = ОпределитьИмяТекущегоПоляНаСервере();
	
	ОпределитьУникальныйИдентификаторПоЗначению(ТекущаяСтрока, ТекущиеДанные[ИмяТекущегоПоля]);
	
КонецПроцедуры

&НаКлиенте
Процедура УказатьСсылкуНаОбъект()
	
	ОписаниеОповещенияОЗавершении = Новый ОписаниеОповещения("УказатьСсылкуНаОбъектЗавершение", ЭтотОбъект);
	
	ПоказатьВводСтроки(ОписаниеОповещенияОЗавершении, "", НСтр("ru = 'Введите GUID или навигационную ссылку на объект текущего справочника'"));
	
КонецПроцедуры

#КонецОбласти

#Область Частные

&НаКлиенте
Процедура УказатьСсылкуНаОбъектЗавершение(Строка, ДополнительныеПараметры) Экспорт
	
	Если Не ЗначениеЗаполнено(Строка) Тогда
		Возврат;
	КонецЕсли;
	
	ПерейтиПоСсылкеНаОбъект(Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиПоСсылкеНаОбъект(СсылкаНаОбъектСтрокой)
	
	СсылкаНаОбъект = ПолучитьСсылкуНаОбъект(СсылкаНаОбъектСтрокой);
	Элементы[ИмяСписка].ТекущаяСтрока = СсылкаНаОбъект;
	
КонецПроцедуры

&НаСервере
Функция ПолучитьСсылкуНаОбъект(Знач СсылкаНаОбъектСтрокой)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Возврат ОбработкаОбъект.НайтиОбъектПоСсылке(ОсновнаяТаблица, СсылкаНаОбъектСтрокой);
	
КонецФункции

&НаСервере
Процедура ОпределитьУникальныйИдентификаторПоЗначению(Знач СсылкаСтроки, Знач СсылкаЯчейки)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	Если ОбъектОбработки.ЭтоСсылка(ТипЗнч(СсылкаСтроки), Истина) Тогда
		УникальныйИдентификаторСтроки = СсылкаСтроки.УникальныйИдентификатор();
		НавигационнаяСсылкаСтроки     = ПолучитьНавигационнуюСсылку(СсылкаСтроки);
	Иначе
		УникальныйИдентификаторСтроки = "";
		НавигационнаяСсылкаСтроки     = "";
	КонецЕсли;
	
	Если ОбъектОбработки.ЭтоСсылка(ТипЗнч(СсылкаЯчейки), Истина) Тогда
		УникальныйИдентификаторЯчейки = СсылкаЯчейки.УникальныйИдентификатор();
		НавигационнаяСсылкаЯчейки     = ПолучитьНавигационнуюСсылку(СсылкаЯчейки);
	Иначе
		УникальныйИдентификаторЯчейки = "";
		НавигационнаяСсылкаЯчейки     = "";
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОпределитьИмяТекущегоПоляНаСервере()
	
	ТекущийЭлементПутьКДанным = Элементы[ИмяСписка].ТекущийЭлемент.ПутьКДанным;
	ЧастиПути = СтрРазделить(ТекущийЭлементПутьКДанным, ".");
	
	Возврат ЧастиПути[1];
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область РаботаСоСпискомЭлементов

#Область Общие

&НаКлиенте
Процедура НайтиСсылкиПоЗначениюРеквизита(ТекущаяСтрока)
	
	ТекущиеДанные = ЭтотОбъект[ИмяСписка].НайтиПоИдентификатору(ТекущаяСтрока);
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ТекущиеДанные.ПолучитьРодителя() = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	//@skip-check use-non-recommended-method
	РаботаСМетаданными = ПолучитьФорму(Объект.ПутьКФормам + "РаботаСМетаданными");
	ДанныеПоСсылкам = РаботаСМетаданными.НайтиСсылкиПоЗначениюРеквизита(
		ТекущиеДанные[РеквизитГруппировки],
		ОсновнаяТаблица, РеквизитГруппировки
	);
	
	Элементы_Уровень1 = ТекущиеДанные.ПолучитьЭлементы();
	Элементы_Уровень1.Очистить();
	
	Для Каждого Ссылка Из ДанныеПоСсылкам Цикл
		НоваяСтрока = Элементы_Уровень1.Добавить();
		НоваяСтрока[РеквизитГруппировки] = Ссылка;
		НоваяСтрока[ИмяРеквизитаТип]    = Строка(ТипЗнч(Ссылка));
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДерево(ОсновнаяТаблица, РеквизитыТаблицы, СистемнаяТаблица)
	
	МассивРеквизитов = Новый Массив;
	
	Если Не ЗначениеЗаполнено(СистемнаяТаблица) Тогда
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяСписка, Новый ОписаниеТипов("ДеревоЗначений")));
	Иначе
		МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяСписка, Новый ОписаниеТипов("ТаблицаЗначений")));
	КонецЕсли;
	
	Для Каждого Реквизит Из РеквизитыТаблицы Цикл
		МассивРеквизитов.Добавить(Новый РеквизитФормы(Реквизит, Новый ОписаниеТипов("Неопределено"), ИмяСписка));
		Если Не ЗначениеЗаполнено(СистемнаяТаблица) Тогда
			ИмяРеквизитаТип = Реквизит + "_Тип";
			МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизитаТип, Новый ОписаниеТипов("Строка"), ИмяСписка,
				Реквизит + " (Тип)"));
			ИмяРеквизитаКоличество = Реквизит + "_Количество";
			МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяРеквизитаКоличество, Новый ОписаниеТипов("Число",
				Новый КвалификаторыЧисла(15)), ИмяСписка, Реквизит + " (Количество)"));
		КонецЕсли;
	КонецЦикла;
	
	ИзменитьРеквизиты(МассивРеквизитов);
	
	Элемент = Элементы.Добавить(ИмяСписка, Тип("ТаблицаФормы"), ЭтотОбъект);
	Элемент.ПутьКДанным              = ИмяСписка;
	Элемент.Видимость                = Истина;
	Элемент.ИзменятьСоставСтрок      = Ложь;
	Элемент.ИзменятьПорядокСтрок     = Ложь;
	Элемент.ТолькоПросмотр           = Истина;
	Элемент.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	
	Если Не ЗначениеЗаполнено(СистемнаяТаблица) Тогда
		Элемент.УстановитьДействие("ПередРазворачиванием", "Подключаемый_ПередРазворачиванием");
	КонецЕсли;
	
	Для Каждого Реквизит Из МассивРеквизитов Цикл
		
		Если Реквизит.Имя = ИмяСписка Тогда
			Продолжить;
		КонецЕсли;
		
		Колонка = Элементы.Добавить(ИмяСписка + Реквизит.Имя, Тип("ПолеФормы"), Элементы[ИмяСписка]);
		Колонка.Вид = ВидПоляФормы.ПолеНадписи;
		Колонка.ПутьКДанным = ИмяСписка + "." + Реквизит.Имя;
		
	КонецЦикла;
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	Запрос = ОбработкаОбъект.ПолучитьЗапросПоПолямОбъекта(ОсновнаяТаблица, РеквизитыТаблицы, Не ЗначениеЗаполнено(СистемнаяТаблица));
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не ЗначениеЗаполнено(СистемнаяТаблица) Тогда
		Элементы_Уровень0 = ЭтотОбъект[ИмяСписка].ПолучитьЭлементы();
	Иначе
		Элементы_Уровень0 = ЭтотОбъект[ИмяСписка];
	КонецЕсли;
	
	Пока Выборка.Следующий() Цикл
		
		ПустаяСтрока = Истина;
		Для Каждого Реквизит Из РеквизитыТаблицы Цикл
			ПустаяСтрока = ПустаяСтрока И Не ЗначениеЗаполнено(Выборка[Реквизит]);
			Если Не ПустаяСтрока Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
		
		Если ПустаяСтрока Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Элементы_Уровень0.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, Выборка);
		
		Если СистемнаяТаблица = "ТочкиМаршрута" И Выборка.Ссылка.Вид <> ВидТочкиМаршрутаБизнесПроцесса.Действие Тогда
			
			Если НоваяСтрока.Представление = "<>" Тогда
				Точка = Новый Структура("Ссылка", Выборка.Ссылка.Имя);
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Точка);
			КонецЕсли;
			
			Продолжить;
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СистемнаяТаблица) Тогда
			Элементы_Уровень1 = НоваяСтрока.ПолучитьЭлементы();
			НоваяСтрока = Элементы_Уровень1.Добавить();
			НоваяСтрока[РеквизитыТаблицы[0]] = "Расшифровка...";
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура СоздатьДинамическийСписок(ОсновнаяТаблица, РеквизитыТаблицы, СистемнаяТаблица)
	
	МассивРеквизитов = Новый Массив;
	МассивРеквизитов.Добавить(Новый РеквизитФормы(ИмяСписка, Новый ОписаниеТипов("ДинамическийСписок")));
	ИзменитьРеквизиты(МассивРеквизитов);
	//@skip-check bsl-legacy-check-string-literal
	ТекущийСписок = ЭтотОбъект["Список"];
	
	ТекущийСписок.ОсновнаяТаблица = ОсновнаяТаблица + ?(Лев(ОсновнаяТаблица, 18) = "РегистрБухгалтерии", ".ДвиженияССубконто", "");
	
	Элемент = Элементы.Добавить(ИмяСписка, Тип("ТаблицаФормы"), ЭтотОбъект);
	Элемент.ПутьКДанным              = ИмяСписка;
	Элемент.Видимость                = Истина;
	Элемент.ИзменятьСоставСтрок      = Ложь;
	Элемент.ИзменятьПорядокСтрок     = Ложь;
	Элемент.ТолькоПросмотр           = Истина;
	Элемент.ПоложениеКоманднойПанели = ПоложениеКоманднойПанелиЭлементаФормы.Нет;
	Элемент.Отображение              = ОтображениеТаблицы.Список;
	
	Элемент.УстановитьДействие("ПриАктивизацииЯчейки", "Подключаемый_ПриАктивизацииЯчейки");
	Элемент.УстановитьДействие("Выбор", "Подключаемый_Выбор");
	
	Кнопка = Элементы.Добавить(ИмяСписка + "ПоказатьВСписке", Тип("КнопкаФормы"), Элемент.КонтекстноеМеню);
	Кнопка.ИмяКоманды = "ПоказатьВСписке";
	
	Для Каждого Реквизит Из РеквизитыТаблицы Цикл
		Колонка = Элементы.Добавить(Реквизит + ИмяСписка, Тип("ПолеФормы"), Элементы[ИмяСписка]);
		Колонка.Вид                    = ВидПоляФормы.ПолеНадписи;
		Колонка.ПутьКДанным            = ИмяСписка + "." + Реквизит;
		Колонка.АвтоМаксимальнаяВысота = Ложь;
		Колонка.АвтоВысотаЯчейки       = Истина;
		Колонка.Высота                 = 10;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(СистемнаяТаблица) Тогда
		ЭлементОтбора = ТекущийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение    = Новый ПолеКомпоновкиДанных("Предопределенный");
		ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Равно;
		ЭлементОтбора.ПравоеЗначение   = Истина;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(РеквизитГруппировки) Тогда
		
		ПолеРеквизитГруппировки = Новый ПолеКомпоновкиДанных(РеквизитГруппировки);
		
		ЭлементОтбора = ТекущийСписок.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ЭлементОтбора.ЛевоеЗначение    = ПолеРеквизитГруппировки;
		ЭлементОтбора.ВидСравнения     = ВидСравненияКомпоновкиДанных.Заполнено;
		ЭлементОтбора.РежимОтображения = РежимОтображенияЭлементаНастройкиКомпоновкиДанных.Недоступный;
		
		ЭлементГруппировки = ТекущийСписок.Группировка.Элементы.Добавить(Тип("ПолеГруппировкиКомпоновкиДанных"));
		ЭлементГруппировки.Поле           = ПолеРеквизитГруппировки;
		ЭлементГруппировки.Использование  = Истина;
		ЭлементГруппировки.ТипГруппировки = ТипГруппировкиКомпоновкиДанных.Иерархия;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#Область РаботаСДанными

#Область Общие

&НаКлиенте
Процедура НайтиСсылкиНаОбъектПоКлючу()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИмяТекущегоПоля = ОпределитьИмяТекущегоПоляНаСервере();
	
	НайтиСсылкиНаТекущийОбъект(ТекущиеДанные[ИмяТекущегоПоля]);
	
КонецПроцедуры

&НаКлиенте
Процедура ПометитьНаУдалениеОбъектПоКлючу()
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(Элементы.Список.ТекущаяСтрока, "КлючЗаписи") = 0 Тогда
		ПометитьНаУдалениеСсылку();
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьОбъектПоКлючу(КонтрольСсылочнойЦелостности = Ложь)
	
	ТекущиеДанные = Элементы.Список.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если СтрНайти(Элементы.Список.ТекущаяСтрока, "КлючЗаписи") > 0 Тогда
		УдалитьЗаписьНаСервере();
	Иначе
		ЗапуститьУдалениеПомеченных(КонтрольСсылочнойЦелостности, РежимОбменаДанными);
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

&НаКлиенте
Процедура СменитьРежимУдаленияОбъекта()
	
	Элементы.ФормаРежимОбменаДанными.Пометка = Не Элементы.ФормаРежимОбменаДанными.Пометка;
	РежимОбменаДанными = Элементы.ФормаРежимОбменаДанными.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗадатьВопросЗапуститьУдалениеВсехПомеченныхБезКонтроля()
	
	ЗадатьВопросЗавершение = Новый ОписаниеОповещения("ЗадатьВопросЗапуститьУдалениеВсехПомеченныхБезКонтроляЗавершение", ЭтотОбъект);
	ПоказатьВопрос(
		ЗадатьВопросЗавершение,
		НСтр("ru = 'Будут удалены все элементы текущего объекта метаданных без ссылочного контроля. Продолжить?'"),
		РежимДиалогаВопрос.ДаНет
	);
	
КонецПроцедуры

#КонецОбласти

#Область Частные

&НаКлиенте
Процедура ЗадатьВопросЗапуститьУдалениеВсехПомеченныхБезКонтроляЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
	
	Если РезультатВопроса = КодВозвратаДиалога.Да Тогда
		ЗапуститьУдалениеВсехПомеченныеБезКонтроля();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура УдалитьЗаписьНаСервере()
	
	КлючиЗаписи = Элементы.Список.ВыделенныеСтроки;
	
	Для Каждого КлючЗаписи Из КлючиЗаписи Цикл
		
		МетаданныеРегистра = КлючЗаписи.Метаданные();
		
		Если МетаданныеРегистра.РежимЗаписи = Метаданные.СвойстваОбъектов.РежимЗаписиРегистра.ПодчинениеРегистратору Тогда
			СообщитьПользователю(НРег("ru = 'Регистр подчинен регистратору'"));
			Возврат;
		КонецЕсли;
		
		МенеджерЗаписи = РегистрыСведений[МетаданныеРегистра.Имя].СоздатьМенеджерЗаписи();
		ЗаполнитьЗначенияСвойств(МенеджерЗаписи, КлючЗаписи);
		МенеджерЗаписи.Прочитать();
		Если Не МенеджерЗаписи.Выбран() Тогда
			СообщитьПользователю(НРег("ru = 'Не удалось выбрать данные по записи'"));
			Возврат;
		КонецЕсли;
		
		МенеджерЗаписи.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьУдалениеПомеченных(Знач КонтрольСсылочнойЦелостности, Знач РежимОбменаДанными)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	
	НайденныеДанные = ОбработкаОбъект.ЗапуститьУдалениеПомеченных(
		Элементы.Список.ВыделенныеСтроки,
		КонтрольСсылочнойЦелостности,
		РежимОбменаДанными
	);
	
	Для Каждого Строка Из НайденныеДанные Цикл
		СообщитьПользователю(Строка(Строка.Данные), Строка.Данные);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗапуститьУдалениеВсехПомеченныеБезКонтроля()
	
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
	ОбработкаОбъект.ЗапуститьУдалениеПомеченных(ОсновнаяТаблица, Ложь);
	
КонецПроцедуры

&НаСервере
Процедура ПометитьНаУдалениеСсылку()
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	Раздел = ОбъектОбработки.ПолучитьРазделПоПолномуИмени(ОсновнаяТаблица);
	
	ЭлементОбъектовМетаданных = Новый Структура; 
	ЭлементОбъектовМетаданных.Вставить("ПолноеИмя",        ОсновнаяТаблица);
	ЭлементОбъектовМетаданных.Вставить("Раздел",           Раздел);
	
	Ссылки = Элементы.Список.ВыделенныеСтроки;
	
	Для Каждого Ссылка Из Ссылки Цикл
		ОбъектОбработки.ПометитьНаУдалениеСсылку(Ссылка, ЭлементОбъектовМетаданных, РежимОбменаДанными);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура НайтиСсылкиНаТекущийОбъект(Знач ТекущаяСсылка)
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	Если Не ОбъектОбработки.ЭтоСсылка(ТипЗнч(ТекущаяСсылка), Истина) Тогда
		СообщитьПользователю(НСтр("ru = 'Выбранная ячейка не содержит ссылки'"));
		Возврат;
	КонецЕсли;
	
	ШаблонСообщения = НСтр("ru = 'Метаданные: %1, Объект: %2'");
	
	Ссылки = Новый Массив;
	Ссылки.Добавить(ТекущаяСсылка);
	НайденныеСсылки = НайтиПоСсылкам(Ссылки);
	Для Каждого НайденнаяСсылка Из НайденныеСсылки Цикл
		Если НайденнаяСсылка.Ссылка = НайденнаяСсылка.Данные Тогда
			Продолжить;
		КонецЕсли;
		СообщитьПользователю(
			СтрШаблон(ШаблонСообщения, Строка(НайденнаяСсылка.Метаданные), Строка(НайденнаяСсылка.Данные)),
			НайденнаяСсылка.Данные
		);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецОбласти